app/Http/Helpers/helpers.php

select * from `admin_notifications` where `admin_id` != 1 and `type` in ('SIDE_NAV')
---
function get_admin_notifications()
{
    $admin = auth()->user();
    $notification_clear_at =   $admin->notification_clear_at;
    if ($notification_clear_at  == null) {
        $notifications = AdminNotification::notAuth()->getByType([NotificationConst::SIDE_NAV])->get();

select * from `payment_gateways` where `id` = 26 limit 1
---
function get_gateway_image($gateway_id){
    $gateway = PaymentGateway::where('id',$gateway_id)->first();