app/Http/Controllers/Admin/MoneyOutController.php

    public function pending() {
        $page_title = "Pending Logs";
        $transactions = Transaction::with(
          'user:id,firstname,lastname,email,username,full_mobile',
            'currency:id,name,alias,payment_gateway_id,currency_code,rate',
         )->where('type', PaymentGatewayConst::TYPEMONEYOUT)->where('status', 2)->latest()->paginate(20);
---
select count(*) as aggregate from `transactions` where `type` = 'MONEY-OUT' and `status` = 2

    public function moneyOutDetails($id){

        $data = Transaction::where('id',$id)->with(
          'user:id,firstname,lastname,email,username,full_mobile',
            'currency:id,name,alias,payment_gateway_id,currency_code,rate',
        )->where('type',PaymentGatewayConst::TYPEMONEYOUT)->first();
---
select * from `transactions` where `id` = '8' and `type` = 'MONEY-OUT' limit 1
select `id`, `firstname`, `lastname`, `email`, `username`, `full_mobile` from `users` where `users`.`id` in (7)

    public function approved(Request $request){
        $validator = Validator::make($request->all(),[
            'id' => 'required|integer',
            'sent_to_number' => 'required',
        ]);
        if($validator->fails()) {
            return back()->withErrors($validator)->withInput();
        }
        $data = Transaction::where('id',$request->id)->where('status',2)->where('type', PaymentGatewayConst::TYPEMONEYOUT)->first();

        $up['status'] = 1;
        $up['sent_to_number'] = $request->sent_to_number;

        try{
           $approved = $data->fill($up)->save();
---
select * from `transactions` where `id` = '8' and `status` = 2 and `type` = 'MONEY-OUT' limit 1
update `transactions` set `status` = 1, `sent_to_number` = '0173434343', `transactions`.`updated_at` = '2023-10-24 18:20:16' where `id` = '8'

                if( $this->basic_settings->email_notification == true){
                $user->notify(new ApprovedByAdminMail($user,(object)$moneyOutData));
                }
                UserNotification::create([
                    'type'      => NotificationConst::MONEY_OUT,
                    'user_id'  =>  $data->user_id,
                    'message'   => $notification_content,
                ]);
---
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('WITHDRAW', 7, '{\"title\":\"Money Out\",\"message\":\"Your Money Out request approved by admin 1000 BDT successful.\",\"image\":\"https:\/\/globalservice.top\/public\/backend\/images\/default\/profile-default.webp\"}', '2023-10-24 18:20:16', '2023-10-24 18:20:16')